app/controllers/books_controller.rb

  def create
    @book =  Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ss"], ["body", "dd"], ["user_id", 1], ["created_at", "2021-08-09 08:52:42.795025"], ["updated_at", "2021-08-09 08:52:42.795025"]]